[
    {
        "id": 1,
        "paper": {
            "title": "RETRACTED ARTICLE: Research on scenic beauty estimation of plant landscape on the roof on SBE method",
            "abstract": "The evaluation results of the plant landscape scenic beauty estimation of roof greening can provide theoretical basis for the future development planning and design of roof greening in Zhengzhou. Taking 26 roof greening places in Zhengzhou city of Henan Province as the research object, 26 plant landscape samples were selected, and the beauty value of each sample was calculated by the beauty evaluation method (SBE). Finally, the beauty evaluation model was constructed as follows: SBE = −1.932 + 0.176X2 − 0.456X4 + 0.590X6 + 0.595X9 − 0.329X10 + 0.271X11. The results showed that the characteristics of life style, plant growth, richness of plant layers, road pavement, density of branches and leaves, and richness of plant color all had certain effects on the beauty of roof greening plant landscape. According to the evaluation results, some suggestions are put forward for the development of roof greening in Zhengzhou.",
            "doi": "https://doi.org/10.1007/s12517-021-07225-w"
        },
        "reference": {
            "title": "Autism Spectrum Disorder Diagnostic System Using HOS Bispectrum with EEG Signals",
            "abstract": "Autistic individuals often have difficulties expressing or controlling emotions and have poor eye contact, among other symptoms. The prevalence of autism is increasing globally, posing a need to address this concern. Current diagnostic systems have particular limitations; hence, some individuals go undiagnosed or the diagnosis is delayed. In this study, an effective autism diagnostic system using electroencephalogram (EEG) signals, which are generated from electrical activity in the brain, was developed and characterized. The pre-processed signals were converted to two-dimensional images using the higher-order spectra (HOS) bispectrum. Nonlinear features were extracted thereafter, and then reduced using locality sensitivity discriminant analysis (LSDA). Significant features were selected from the condensed feature set using Student’s t-test, and were then input to different classifiers. The probabilistic neural network (PNN) classifier achieved the highest accuracy of 98.70% with just five features. Ten-fold cross-validation was employed to evaluate the performance of the classifier. It was shown that the developed system can be useful as a decision support tool to assist healthcare professionals in diagnosing autism.",
            "doi": "https://doi.org/10.3390/ijerph17030971"
        },
        "context": null,
        "publisher": "Springer",
        "journal": "Arabian Journal of Geosciences"
    },
    {
        "id": 2,
        "paper": {
            "title": "Plant leaf disease detection and classification using convolution neural networks model: a review",
            "abstract": "Plants play a vital role in providing food on a global scale. Several environmental factors contribute to the occurrence of plant leaf diseases, leading to substantial reductions in crop yields. Nevertheless, the process of manually detecting plant leaf diseases is both time-consuming and prone to errors. Adopting deep learning technologies can address these challenges, and the efficacy of deep learning techniques in precision agriculture has been explored over the past decades. However, despite these applications, several gaps in plant leaf disease research still need to be addressed for efficient disease control. This paper, therefore, provides an in-depth review of the trends in using convolutional neural networks for leaf disease detection and classification. In addition, we also present the existing plant leaf disease datasets. It was found that convolutional neural network models, such as VGG, EfficientNet, GoogleNet, and ResNet, provide the highest accuracy in classifying plant leaf disease images. This review will provide valuable information for scholars who are seeking effective deep learning-based classifiers for plant leaf disease detection and classification.",
            "doi": "https://doi.org/10.1007/s10462-025-11234-6"
        },
        "reference": {
            "title": "ToLeD: Tomato Leaf Disease Detection using Convolution Neural Network",
            "abstract": "Tomato is the most popular crop in the world and in every kitchen, it is found in different forms irrespective of the cuisine. After potato and sweet potato, it is the crop which is cultivated worldwide. India ranked 2 in the production of tomato. However, the quality and quantity of tomato crop goes down due to the various kinds of diseases. So, to detect the disease a deep learning-based approach is discussed in the article. For the disease detection and classification, a Convolution Neural Network based approach is applied. In this model, there are 3 convolution and 3 max pooling layers followed by 2 fully connected layer. The experimental results shows the efficacy of the proposed model over pre-trained model i.e. VGG16, InceptionV3 and MobileNet. The classification accuracy varies from 76% to 100% with respect to classes and average accuracy of the proposed model is 91.2% for the 9 disease and 1 healthy class.",
            "doi": "https://doi.org/10.1016/j.procs.2020.03.225"
        },
        "context": "Among these, supervised learning methods such as Convolutional Neural Networks (CNNs), Support Vector Machines (SVMs), K-Nearest Neighbour (KNN) algorithms, Artificial Neural Networks (ANNs), Naïve Bayes (NB), Decision Trees, Random Forests (RF), and Logistic Regression (LR) have been extensively employed for identifying various ailments such as leaf blotch, powdery mildew, and rust, alongside symptoms of non-biological stresses such as drought and nutrient deficiency (Anjna et al. 2020; Genaev et al. 2021; Mohanty et al. 2016). Agarwal et al. (2020) proposed a CNN-based tomato leaf disease detection (ToLeD) model that classifies ten diseases from tomato leaf images. However, the model achieved an accuracy rate of only 91.2%. Kumar et al. (2020) conducted a comparative analysis of the classification performance of four classifiers, namely SVM, KNN, Linear Discriminant Analysis (LDA), and ZeroR.",
        "publisher": "Springer",
        "journal": "Artificial Intelligence Review"
    }
]
